class Solution {
public:
    int climbStairs(int n) {
        //动态规划滚动数组
        //假设有n阶楼梯，f(x)表示爬到第 x 级台阶的方案数，f(x) = f(x-1) + f(x-2),它意味着爬到第 x 级台阶的方案数是爬到
        //第 x−1 级台阶的方案数和爬到第 x−2 级台阶的方案数的和。很好理解，因为每次只能爬 1 级或 2 级，所以 f(x) 只能从
        //f(x−1) 和 f(x−2) 转移过来，而这里要统计方案总数，我们就需要对这两项的贡献求和。
        //讨论边界条件，从第0级开始，只有一种爬法，f(0)=1,从第0级到第一级也是一种，即f(1)=1,以此类推f(2)=2,f(3)=3,
        //f(4)=5...
        //这里用滚动数组思想将空间复杂度优化成O(1)
        int p = 0, q = 0, r = 1;
        for(int i = 0;i < n; ++i){
            p = q;
            q = r;
            r = p+q;
        }
        return r;
    }
};